Repository: yben27/emacslispref
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: fr_fr

source: Empty matches do count, except that @code{split-string} will not look for a final empty match when it already reached the end of the string using a non-empty match or when @var{string} is empty:
fr_fr: Les correspondances vides comptent bien, sauf que @code{split-string} ne cherchera pas une correspondance vide lorsqu'elle a déjà atteint la fin de la chaîne en utilisant un correspondance non vide ou lorsque @var{string} est vide:

source: Equality and inequality predicates.
fr_fr: Attributs d'égalité et d'inégalité.

source: Error Messages
fr_fr: Messages d'erreur

source: Evaluation
fr_fr: Évaluation

source: Evaluation Notation
fr_fr: Notation d'évaluation

source: Examples in this manual indicate printed text with @samp{@print{}}, irrespective of where that text goes. The value returned by evaluating the form (here @code{bar}) follows on a separate line with @samp{@result{}}.
fr_fr: Les exemples de ce manuel indiquent le texte affiché avec @samp{@print{}}, indépendamment de la destination du texte. La valeur retournée par l'évaluation du formulaire (ici @code{bar}) suit sur une ligne séparée avec @samp{@result{}}.

source: Examples of Lisp code are formatted like this: @code{(list 1 2 3)}. Names that represent metasyntactic variables, or arguments to a function being described, are formatted like this: @var{first-number}.
fr_fr: Des exemples du code de Lisp sont composés comme ceci : @code{(list 1 2 3)}. Des noms qui représentent des variables, ou des arguments à une fonction décrite, sont composés comme ceci : @var{first-number}.

source: Expansion: Abbrev Expansion
fr_fr: Expansion : Expansions d'abréviations

source: Explanation of terms we use in this manual.
fr_fr: Explication des termes que nous employons en ce manuel.

source: Explicitly rounding floating point numbers.
fr_fr: Arrondir explicitement les nombres à virgule flottante.

source: Files: Abbrev Files
fr_fr: Fichiers : Fichiers d'abréviations

source: Flaws and a request for help.
fr_fr: Erreurs et demande d'aide.

source: Float Basics
fr_fr: Introduction aux nombres à virgule flottante

source: Floating Point Basics
fr_fr: Introduction aux nombres à virgule flottante

source: Floating point numbers are useful for representing numbers that are not integral. The precise range of floating point numbers is machine-specific; it is the same as the range of the C data type @code{double} on the machine you are using.
fr_fr: Les nombres à virgule flottante sont utiles pour la représentation des nombres qui ne sont pas intégraux. Le champ précis des nombres à virgule flottante est propre à la machine ; c'est identique au champ du type de données de C @code{double} sur la machine que vous employée.

source: For any two integers @var{dividend} and @var{divisor},
fr_fr: Pour deux nombres entiers quelconques @var{dividend} et @var{divisor},

source: For any two numbers @var{dividend} and @var{divisor},
fr_fr: Pour deux nombres quelconques @var{dividend} et @var{divisor},

source: For example, using 4-bit binary numbers, the ``logical and'' of 13 and 12 is 12: 1101 combined with 1100 produces 1100. In both the binary numbers, the leftmost two bits are set (i.e., they are 1's), so the leftmost two bits of the returned value are set. However, for the rightmost two bits, each is zero in at least one of the arguments, so the rightmost two bits of the returned value are 0's.
fr_fr: Par exemple, en utilisant des nombres binaires de 4 bits, le « et logique » de 13 et 12 est 12 : 1101 combiné avec 1100 produit 1100. Dans les deux nombres binaires, les deux bits à l'extrême gauche sont placés (c.-à-d., ils sont à 1), ainsi les deux bits à l'extrême gauche de la valeur retournée sont placés. Cependant, pour les deux bits à l'extrême droite, chacun est à zéro dans au moins un des arguments, ainsi les deux bits à l'extrême droite de la valeur retournée sont 0.

source: For information about other concatenation functions, see the description of @code{mapconcat} in @ref{Mapping Functions}, @code{vconcat} in @ref{Vector Functions}, and @code{append} in @ref{Building Lists}.
fr_fr: Pour plus d'information sur les autres fonctions de concaténation, regarder les descriptions de @code{mapconcat} dans @ref{Mapping Functions}, @code{vconcat} dans @ref{Functions for Vectors}, et @code{append} dans @ref{Building Cons Cells and Lists}.

source: For more information about general sequence and array predicates, see @ref{Sequences Arrays Vectors}, and @ref{Arrays}.
fr_fr: Pour plus d’informations sur les prédicats généraux des suites et des tableaux, voir @xref{Sequences, Arrays, and Vectors}, et @xref{Arrays}.

source: For negative arguments, the remainder is in principle machine-dependent since the quotient is; but in practice, all known machines behave alike.
fr_fr: Pour des arguments négatifs, le reste est en principe dépendant de la machine puisque le quotient est variable ; mais dans la pratique, toutes les machines connues se comportent de la même façon.

source: For other concatenation functions, see @code{mapconcat} in @ref{Mapping Functions}, @code{concat} in @ref{Creating Strings}, and @code{append} in @ref{Building Lists}.
fr_fr: Pour d'autres fonctions de concaténation, voir @code{mapconcat} dans @ref{Mapping Functions}, @code{concat} dans @ref{Creating Strings}, et @code{append} dans @ref{Building Lists}.

source: For purposes of evaluation, the array is a constant---in other words, it evaluates to itself.
fr_fr: Pour les besoins d'évaluation, le tableau est une constante, c'est-à-dire qu'il s'évalue lui-même.

source: For some languages, upper and lower case letters are not in one-to-one correspondence. There may be two different lower case letters with the same upper case equivalent. In these cases, you need to specify the maps for both lower case and upper case.
fr_fr: Pour certaines langues, les lettres minuscules et majuscules ne sont pas en correspondance une-à-une. Il peut y avoir deux différentes lettres minuscules avec le même équivalent en majuscule. Dans ce cas, on doit spécifier le mappage à la fois pour les minuscules et pour les majuscules.

source: For technical reasons, a unibyte and a multibyte string are @code{equal} if and only if they contain the same sequence of character codes and all these codes are either in the range 0 through 127 (@acronym{ASCII}) or 160 through 255 (@code{eight-bit-graphic}). However, when a unibyte string gets converted to a multibyte string, all characters with codes in the range 160 through 255 get converted to characters with higher codes, whereas @acronym{ASCII} characters remain unchanged. Thus, a unibyte string and its conversion to multibyte are only @code{equal} if the string is all @acronym{ASCII}. Character codes 160 through 255 are not entirely proper in multibyte text, even though they can occur. As a consequence, the situation where a unibyte and a multibyte string are @code{equal} without both being all @acronym{ASCII} is a technical oddity that very few Emacs Lisp programmers ever get confronted with. @xref{Text Representations}.
fr_fr: Pour des raisons techniques, une chaîne uni-octet et une chaîne multi-octet sont @code{equal} si et seulement si elles contiennent la même suite de codes de caractère et si tous ces codes sont soit dans la plage de 0 à 127 (@acronym{ASCII}) ou dans la plage de 160 à 255 (@code{eight-bit-graphic}). Cependant, quand une chaîne de caractères uni-octet est convertie en une chaîne multi-octets, tous les caractères avec des codes dans la plage de 160 à 255 sont convertis en caractères avec des codes plus grands, alors que les caractères @acronym{ASCII} restent inchangés. Donc, une chaîne uni-octet et sa conversion en multi-octet sont seulement @code{equal} si la chaîne est entièrement en @acronym{ASCII}. Les codes de caractères de 160 à 255 ne sont pas tout à fait appropriés dans le texte multi-octets, même s'il arrive qu'on les y rencontre. En conséquence, la situation où une chaîne uni-octet et une chaîne multi-octet sont @code{equal} sans être toutes deux entièrement @acronym{ASCII} est une curiosité technique à laquelle très peu de programmeurs Emacs Lisp se trouvent confrontés. Voir la section @xref{Text Representations}.

source: For the user-level commands for abbrevs, see @ref{Abbrevs,, Abbrev Mode, emacs, The GNU Emacs Manual}.
fr_fr: Pour les commandes du niveau utilisateur des abréviations, voir @ref{Abbrevs,, Abbrev Mode, emacs, The GNU Emacs Manual}.

source: Format of Descriptions
fr_fr: Format de descriptions

source: Formatting Strings
fr_fr: Formatter les chaînes

source: Formatting is often useful for computing messages to be displayed. In fact, the functions @code{message} and @code{error} provide the same formatting feature described here; they differ from @code{format} only in how they use the result of formatting.
fr_fr: Le formatage est souvent utile pour le calcul de messages à afficher. En fait, les fonctions @code{message} et @code{error} fournissent la même fonctionnalité de formatage décrite ici; elles diffèrent de @code{format} seulement dans la façon dont elles utilisent le résultat de la mise en forme.

source: Function
fr_fr: Fonction

source: Functions
fr_fr: Fonctions

source: Functions for Vectors
fr_fr: Fonctions pour les vecteurs

source: Functions specifically for arrays.
fr_fr: Fonctions spécifiques aux tableaux.

source: Functions specifically for vectors.
fr_fr: Fonctions spécifiques aux vecteurs.

source: Functions that Operate on Arrays
fr_fr: Fonctions qui manipulent des tableaux

source: Functions that accept any kind of sequence.
fr_fr: Des fonctions qui acceptent n'importe quel type de suite.

source: Functions to allocate new strings.
fr_fr: Fonctions pour allouer de nouvelles chaînes.

source: Functions, variables, macros, commands, user options, and special forms are described in this manual in a uniform format. The first line of a description contains the name of the item followed by its arguments, if any.
fr_fr: Des fonctions, les variables, les macros, les commandes, les options d'utilisateur, et les formulaires spéciaux sont décrits dans ce manuel dans un format uniforme. La première ligne de la description contient le nom de l'article suivi de ses arguments, s'il y a.

source: GNU Emacs Internals
fr_fr: Fonctionnement interne de GNU Emacs

source: GNU Emacs Lisp is largely inspired by Maclisp, and a little by Common Lisp. If you know Common Lisp, you will notice many similarities. However, many features of Common Lisp have been omitted or simplified in order to reduce the memory requirements of GNU Emacs. Sometimes the simplifications are so drastic that a Common Lisp user might be very confused. We will occasionally point out how GNU Emacs Lisp differs from Common Lisp. If you don't know Common Lisp, don't worry about it; this manual is self-contained.
fr_fr: GNU Emacs Lisp est en grande partie inspiré par Maclisp, et par Common Lisp. Si vous connaissez le Common Lisp, vous noterez beaucoup de similitudes. Cependant, beaucoup de dispositifs de Common Lisp ont été omis ou simplifié afin de réduire les conditions de mémoire de GNU Emacs. Parfois les simplifications sont si importantes qu'un utilisateur Lisp Common pourrait être très dérouté. Nous préciserons de temps en temps comment le GNU Emacs Lisp diffère du Common Lisp. Si vous ne connaissez pas le Common Lisp, ne vous inquiétez à son sujet; ce manuel est indépendant.

source: GNU Emacs supports two numeric data types: @dfn{integers} and @dfn{floating point numbers}. Integers are whole numbers such as @minus{}3, 0, 7, 13, and 511. Their values are exact. Floating point numbers are numbers with fractional parts, such as @minus{}4.5, 0.0, or 2.71828. They can also be expressed in exponential notation: 1.5e2 equals 150; in this example, @samp{e2} stands for ten to the second power, and that is multiplied by 1.5. Floating point values are not exact; they have a fixed, limited amount of precision.
fr_fr: GNU Emacs supporte deux types de données numériques : @dfn{entiers} et @dfn{nombres à virgule flottante}. Les nombres entiers sont des nombres entiers tels que @minus{}3, 0, 7, 13, et 511. Leurs valeurs sont exactes. Les nombres à virgule flottante sont des nombres avec les parties partielles, telles que le @minus{}4.5, 0.0, ou 2.71828. Ils peuvent également être exprimés en notation exponentielle : 1.5e2 est égal à 150 ; dans cet exemple, le @samp{e2} représente dix à la puissance deux, le tout est multiplié par 1.5. Les valeurs à virgule flottante ne sont pas exactes ; elles sont fixes et limitées en précision.

source: Generally speaking, the earlier chapters describe features of Emacs Lisp that have counterparts in many programming languages, and later chapters describe features that are peculiar to Emacs Lisp or relate specifically to editing.
fr_fr: D'une manière générale, les premiers chapitres décrivent les caractéristiques d'Emacs Lisp qui ont des équivalences dans beaucoup de langages de programmation, et les chapitres postérieurs décrivent les caractéristiques qui sont particulières au Emacs Lisp ou se relient spécifiquement à l'édition.

source: Hash Table Access
fr_fr: Accès à une table de hachage

source: Hash Tables
fr_fr: Tables de hachage

source: Here are examples illustrating these principles:
fr_fr: Voici quelques exemples illustrant ces principes :

source: Here are other examples:
fr_fr: Voici d'autres exemples:

source: Here are several examples:
fr_fr: Voici quelques exemples :

source: Here are some functions that relate to vectors:
fr_fr: Voici quelques fonctions relatives aux vecteurs :

source: Here are some other functions for working with hash tables.
fr_fr: Voici d'autres fonctions pour travailler avec les tables de hachage.

source: Here are some other functions that can convert to or from a string:
fr_fr: @code{string-to-int} est un alias obsolète de cette fonction :

source: Here are the functions for working with case tables:
fr_fr: Voici les fonctions pour travailler avec les tableaux de casse :

source: Here are two examples of @code{lsh}, shifting a pattern of bits one place to the left. We show only the low-order eight bits of the binary pattern; the rest are all zero.
fr_fr: Voici deux exemples de @code{lsh}, décalant une combinaison de chiffres binaires d'une place vers la gauche. Nous montrons seulement les huit bits faibles du binaire modèle ; le reste est fait de zéro.

source: Here is a description of an imaginary function @code{foo}:
fr_fr: Voici une description de fonction imaginaire @code{foo}:

source: Here is a table of valid format specifications:
fr_fr: Voici un tableau des spécifications de format valides :

source: Here is an example of creating, examining, and updating a bool-vector. Note that the printed form represents up to 8 boolean values as a single character.
fr_fr: Voici un exemple de création, d'examen et de mise-à-jour d'un vecteur-booléen. Il faut noter que la forme affichée représente jusqu'à 8 valeurs booléennes comme un seul caractère.

source: Here is how you could define a hash table test equivalent to the predefined test value @code{equal}. The keys can be any Lisp object, and equal-looking objects are considered the same key.
fr_fr: Voici comment on peut définir une table de hachage de test équivalente à la valeur de test prédéfinie @code{equal}. Les clés peuvent être n'importe quel objet Lisp, et des objets apparemment égaux sont considérés comme la même clé.

source: Here the index for @samp{a} is 0, the index for @samp{b} is 1, and the index for @samp{c} is 2. Thus, three letters, @samp{abc}, are copied from the string @code{"abcdefg"}. The index 3 marks the character position up to which the substring is copied. The character whose index is 3 is actually the fourth character in the string.
fr_fr: Soit l’indice de @samp{a} égale à 0, l’indice de @samp{b} égale à 1, et l’indice de @samp{c} égale à 2. Ainsi, les trois lettres, @samp{abc}, sont copiées depuis la chaîne @code{"abcdefg"}. L'indice 3 marque la position de caractère à laquelle la sous-chaîne est copiée. Le caractère dont l'indice est 3 est en fait le quatrième caractère de la chaîne.

source: How Lisp expressions are evaluated.
fr_fr: Comment les expressions Lisp sont évaluées.

source: How symbols are kept unique.
fr_fr: Comment les symboles sont gardés uniques.

source: How the editor command loop works,
fr_fr: Comment fonctionne la boucle de commande de l'éditeur,

source: How the manual is formatted.
fr_fr: Comment le manuel est composé.

source: How the symbols @code{nil} and @code{t} are used.
fr_fr: Comment les symboles @code{nil} et @code{t} sont employés.

source: How to add, subtract, multiply and divide.
fr_fr: Comment additionner, soustraire, multiplier et diviser.

source: How to work with bool-vectors.
fr_fr: Comment travailler avec les vecteurs-booléens.

source: How to work with char-tables.
fr_fr: Comment travailler avec les char-tables.

source: However, when @var{separators} can match the empty string, @var{omit-nulls} is usually @code{t}, so that the subtleties in the three previous examples are rarely relevant:
fr_fr: Cependant, quand les @var{separators} arrivent à correspondre à une chaîne vide, @var{omit-nulls} est souvent @code{t}, de sorte que les subtilités constatées dans les trois exemples précédents sont rarement pertinentes:

source: If @code{logand} is not passed any argument, it returns a value of @minus{}1. This number is an identity element for @code{logand} because its binary representation consists entirely of ones. If @code{logand} is passed just one argument, it returns that argument.
fr_fr: Si @code{logand} est passé sans argument, il renvoie une valeur @minus{}1. Ce nombre est un élément d'identité pour @code{logand} parce que sa représentation binaire consiste entièrement de 1. Si @code{logand} est passé à juste un argument, il renvoie cet argument.

source: If @var{array} is a string and @var{object} is not a character, a @code{wrong-type-argument} error results.
fr_fr: Si @var{array} est une chaîne de caractères et que @var{object} n'est pas un caractère, il en résultera une erreur @code{wrong-type-argument}.

source: If @var{array} is a string and @var{object} is not a character, a @code{wrong-type-argument} error results. The function converts a unibyte string to multibyte if necessary to insert a character.
fr_fr: Si @var{array} est une chaîne de caractères et @var{object} n'est pas un caractère, il en résultera une erreur @code{wrong-type-argument}. La fonction convertit une chaîne de caractères unioctet en multioctet si nécessaire pour insérer un caractère.

source: If @var{divisor} is specified, this uses the kind of division operation that corresponds to @code{mod}, rounding downward.
fr_fr: Si @var{divisor} est indiqué, ceci utilise le genre d'opération de division qui correspond à @code{mod}, arrondissant en bas.

source: If @var{from} and @var{to} are omitted, @var{var} is bound to @code{nil} before the loop begins, and the loop exits if @var{var} is non-@code{nil} at the beginning of an iteration. Here is an example:
fr_fr: Si @var{from} et @var{to} sont omis, @var{var} est lié à @code{nil} avant que la boucle commence, et la boucle est arrêtée si @var{var} est non-@code{nil} au début d'une itération. Voici un exemple :

source: If @var{here} is non-@code{nil}, it inserts the text in the buffer before point, and returns @code{nil}. Called interactively, the function prints the same information in the echo area, but giving a prefix argument makes @var{here} non-@code{nil}.
fr_fr: Si @var{here} est non-@code{nil}, ça insère le texte dans le tampon avant le point, et renvoie le @code{nil}. Appelée interactivement, la fonction affiche la même information dans le secteur d'écho, mais en donnant un argument de préfixe rend @var{here} non-@code{nil}.

source: If @var{hook} is a non-@code{nil} symbol whose @code{no-self-insert} property is non-@code{nil}, @var{hook} can explicitly control whether to insert the self-inserting input character that triggered the expansion. If @var{hook} returns non-@code{nil} in this case, that inhibits insertion of the character. By contrast, if @var{hook} returns @code{nil}, @code{expand-abbrev} also returns @code{nil}, as if expansion had not really occurred.
fr_fr: Si @var{hook} is a non-@code{nil} symbol whose @code{no-self-insert} property is non-@code{nil}, @var{hook} can explicitly control whether to insert the self-inserting input character that triggered the expansion. If @var{hook} returns non-@code{nil} in this case, that inhibits insertion of the character. By contrast, if @var{hook} returns @code{nil}, @code{expand-abbrev} also returns @code{nil}, as if expansion had not really occurred.

source: If @var{human} is non-@code{nil}, the description is human-oriented. System abbrevs are listed and identified as such. Otherwise the description is a Lisp expression---a call to @code{define-abbrev-table} that would define @var{name} as it is currently defined, but without the system abbrevs. (The mode or package using @var{name} is supposed to add these to @var{name} separately.)
fr_fr: Si @var{human} est non-@code{nil}, la description est orientée pour l'humain. Des abréviations de système sont énumérées et identifiées en tant que telles. Autrement la description est une expression de Lisp---un appel à @code{define-abbrev-table} définirait @var{name} comme il l'est actuellement, mais en dehors des abréviations de système---. (Le mode ou le paquet employant @var{name} est supposé ajouter ces derniers à @var{name} séparément.)

source: If @var{limit} is @code{t}, it means to choose a new seed based on the current time of day and on Emacs's process @acronym{ID} number.
fr_fr: Si @var{limit} est @code{t}, cela signifie de choisir une nouvelle graine basée sur heure courante et sur le numéro de processus @acronym{ID} d'Emacs.

source: If @var{limit} is a positive integer, the value is chosen to be nonnegative and less than @var{limit}.
fr_fr: Si @var{limit} est un nombre entier positif, la valeur est choisie pour être non négative et inférieure à @var{limit}.

source: If @var{omit-nulls} is @code{nil}, the result contains null strings whenever there are two consecutive matches for @var{separators}, or a match is adjacent to the beginning or end of @var{string}. If @var{omit-nulls} is @code{t}, these null strings are omitted from the result.
fr_fr: Si @var{omit-nulls} est @code{nil}, le résultat contient des chaînes vides chaque fois qu'il y a deux correspondances consécutives pour les @var{separators}, ou si la correspondance est adjacente au début ou à la fin de la @var{string}. Si @var{omit-nulls} est @code{t}, ces chaînes vides ne sont pas prises en compte dans le résultat.

source: If @var{rehash-size} is an integer, it should be positive, and the hash table grows by adding that much to the nominal size. If @var{rehash-size} is a floating point number, it had better be greater than 1, and the hash table grows by multiplying the old size by that number.
fr_fr: Si @var{rehash-size} est un entier, il doit être positif, et la table de hachage s'agrandira en partant de sa valeur nominale et en y ajoutant cet entier positif. Si @var{rehash-size} est un nombre à virgule flottante, il vaut mieux qu'il soit supérieur à 1 et la table de hachage s'agrandira en multipliant l'ancienne taille par ce nombre.

source: If @var{separators} is @code{nil} (or omitted), the default is the value of @code{split-string-default-separators}.
fr_fr: Si @var{separators} est @code{nil} (ou non renseigné), la valeur par défaut est la valeur de @code{split-string-default-separators}.
